aedile/FIESTACADE/sdkconfig.defaults
# MINIMAME launcher - Waveshare ESP32-C6-LCD-1.69
CONFIG_IDF_TARGET="esp32c6"
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160=y

# 16 MB W25Q128
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# The launcher lives in a 512K slot and does no emulation - optimise for size.
CONFIG_COMPILER_OPTIMIZATION_SIZE=y

CONFIG_FREERTOS_HZ=1000
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

# Power management (medal runs on battery)
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_PM_DFS_INIT_AUTO=y
